# CannotCopyFamilyName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyFamilyName Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't [Action] because Family '[Family Name]' is different in the two documents. Update the documents to contain the same version of the Family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyFamilyName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyFamilyName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyFamilyName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace